---
kind: method
id: M:Autodesk.Revit.DB.FamilyTypeSet.Insert(Autodesk.Revit.DB.FamilyType)
source: html/bf24062a-6fa8-4a49-9ace-af2231542a61.htm
---
# Autodesk.Revit.DB.FamilyTypeSet.Insert Method

## Syntax (C#)
```csharp
public virtual bool Insert(
	FamilyType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.FamilyType`)